# -*- fill-column: 80; -*-
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:nil arch:headline author:t broken-links:nil
#+options: c:nil creator:nil d:t date:t e:t email:nil f:t inline:t num:nil
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t timestamp:t title:t toc:1
#+options: todo:t |:t
#+title: Konvoy Training Workshop
#+date: <2019-08-22 Thu>
#+author: D2iQ SE Team
#+instructors: Greg Grubbs, Valerian Jone
#+slide_header: github.com/mesosphere/konvoy-training
#+email: ggrubbs@d2iq.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 26.2 (Org mode 9.2.3)
#+SETUPFILE: /Users/gregj/projects/org-html-themes/setup/theme-bigblow.setup
# #+SETUPFILE: https://raw.githubusercontent.com/fniessen/org-html-themes/master/setup/theme-readtheorg.setup
** Lab Steps
In this lab, we'll deploy the
[[https://hub.helm.sh/charts/stable/jenkins][Jenkins Helm chart]].

To deploy the chart, you need to run the following command:

#+begin_src sh 
  helm install stable/jenkins --name jenkins --version 1.5.0 --set master.adminPassword=password
#+end_src

#+RESULTS:
#+begin_example
  NAME:   jenkins
  LAST DEPLOYED: Wed Aug  7 17:21:32 2019
  NAMESPACE: default
  STATUS: DEPLOYED

  RESOURCES:
  ==> v1/ConfigMap
  NAME           DATA  AGE
  jenkins        5     1s
  jenkins-tests  1     1s

  ==> v1/Deployment
  NAME     READY  UP-TO-DATE  AVAILABLE  AGE
  jenkins  0/1    1           0          1s

  ==> v1/PersistentVolumeClaim
  NAME     STATUS   VOLUME                CAPACITY  ACCESS MODES  STORAGECLASS  AGE
  jenkins  Pending  awsebscsiprovisioner  1s

  ==> v1/Pod(related)
  NAME                     READY  STATUS   RESTARTS  AGE
  jenkins-c79f457cb-ccttb  0/1    Pending  0         1s

  ==> v1/Role
  NAME                     AGE
  jenkins-schedule-agents  1s

  ==> v1/RoleBinding
  NAME                     AGE
  jenkins-schedule-agents  1s

  ==> v1/Secret
  NAME     TYPE    DATA  AGE
  jenkins  Opaque  2     1s

  ==> v1/Service
  NAME           TYPE          CLUSTER-IP  EXTERNAL-IP  PORT(S)         AGE
  jenkins        LoadBalancer  10.0.9.26   <pending>    8080:30323/TCP  1s
  jenkins-agent  ClusterIP     10.0.41.64  <none>       50000/TCP       1s

  ==> v1/ServiceAccount
  NAME     SECRETS  AGE
  jenkins  1        1s
#+end_example


Then, run the following command to get the URL of the Load Balancer
created on AWS for this service:

#+begin_src sh
  kubectl get svc jenkins
#+end_src

#+begin_example
NAME      TYPE           CLUSTER-IP   EXTERNAL-IP                                                              PORT(S)          AGE
  jenkins   LoadBalancer   10.0.9.26    a71b8025991124a90b2babf7ba2a75da-492974167.us-west-2.elb.amazonaws.com   8080:30323/TCP   16m
#+end_example

You need to wait for a few minutes while the Load Balancer is created on
AWS and the name resolution in place.

#+begin_src sh :results replace verbatim :exports code
until nslookup $(kubectl get svc jenkins --output jsonpath={.status.loadBalancer.ingress[*].hostname})
  do
    sleep 1
  done
  echo "Open http://$(kubectl get svc jenkins --output jsonpath={.status.loadBalancer.ingress[*].hostname}):8080 to access the Jenkins UI"
#+end_src

#+begin_example
Server:		100.115.92.193
Address:	100.115.92.193#53

Non-authoritative answer:
Name:	a3b2b652ab4354e7f8eded17d4323afb-1148896961.us-west-2.elb.amazonaws.com
Address: 52.37.201.113
Name:	a3b2b652ab4354e7f8eded17d4323afb-1148896961.us-west-2.elb.amazonaws.com
Address: 52.34.15.160

Open http://a3b2b652ab4354e7f8eded17d4323afb-1148896961.us-west-2.elb.amazonaws.com:8080 to access the Jenkins UI
#+end_example


Go to the corresponding URL to access Jenkins

Login with the user =admin= and the password =password=.

